#+TITLE:Cofiguring on
#+AUTHOR:fmon
#+STARTUP:overview

** Emacs

#+begin_src elisp
(use-package emacs
  :straight nil
  :init
  (setq completion-cycle-threshold 3)
  (setq tab-always-indent 'complete)
)

(add-hook 'kill-emacs-hook 'org-save-all-org-buffers)
#+end_src

#+RESULTS:
| bookmark-exit-hook-internal | org-fc-review-history-save | org-id-locations-save | org-clock-save | flycheck-global-teardown | savehist-autosave | transient-maybe-save-history | org-save-all-org-buffers | org-babel-remove-temporary-directory |

** Compilation

#+begin_src elisp
(use-package compile
  :straight nil)
#+end_src

#+RESULTS:
| (lambda nil (setq-local compile-command (concat gcc -Wall -Wextra -g  (shell-quote-argument (file-name-sans-extension buffer-file-name))  -o))) | (lambda nil (setq-local compile-command (concat gcc -Wall -Wextra -g  (shell-quote-argument (file-name-sans-extension buffer-file-name))  -o ))) | (lambda nil (setq-local compile-command (concat gcc -Wall -Wextra -g  (buffer-file-name (window-buffer (minibuffer-selected-window)))  -o ))) | (lambda nil (setq-local compile-command (concat gcc -Wall -Wextra -g  (if buffer-file-name (shell-quote-argument (file-name-sans-extension buffer-file-name)))))) | lsp-mode | corfu-mode | (lambda nil (add-to-list 'completion-at-point-functions #'clang-capf)) |

** Eshell

#+begin_src elisp
(use-package eshell
  :straight nil
  :config
  (setq eshell-prompt-function
	(lambda ()
          (concat
           (propertize "â”Œâ”€[" 'face `default)
           (propertize (user-login-name) 'face `font-lock-keyword-face)
           (propertize "@" 'face `default)
           (propertize (system-name) 'face `font-lock-builtin-face)
           (propertize "]â”€â”€[" 'face `default)
           (propertize (concat (eshell/pwd)) 'face `font-lock-string-face)
           (propertize "]ðŸ§\n" 'face `default)
           (propertize "â””â”€>" 'face `default)
           (propertize (if (= (user-uid) 0) " # " " $ ") 'face `default)
           )))
  :hook
  (eshell-mode . (lambda () (setenv "TERM" "xterm-256color")))
  (eshell-mode . (lambda ()
		   (eshell/alias "ff" "find-file $1")
		   (eshell/alias "ee" "exit")
		   (eshell/alias "d" "dired $1")
		   )))
#+end_src

#+RESULTS:
| lambda | nil | (eshell/alias ff find-file $1) | (eshell/alias ee exit) | (eshell/alias d dired $1) | (eshell/alias ytdlp22 yt-dlp -f 22) |
| lambda | nil | (eshell/alias ff find-file $1) | (eshell/alias ee exit) | (eshell/alias d dired $1) |                                     |
| lambda | nil | (setenv TERM xterm-256color)   |                        |                           |                                     |

** Pyright

#+begin_src elisp
(use-package lsp-pyright
  :hook (python-mode . (lambda () (require 'lsp-pyright)(lsp))))
#+end_src

#+RESULTS:
| (lambda nil (require 'lsp-pyright) (lsp)) | doom-modeline-env-setup-python |
** Lsp

#+begin_src elisp
(use-package lsp-mode
  :custom
  (lsp-completion-provider :none) 	; corfu
  (lsp-idle-delay 0.1)
  :init
  (setq lsp-keymap-prefix "C-c l")
  (defun my/lsp-mode-setup-completion ()
    (setf (alist-get 'styles (alist-get 'lsp-capf completion-category-defaults))
          '(orderless))) ;; Configure orderless
  :hook
  (lsp-completion-mode . my/lsp-mode-setup-completion)
  (lsp-mode . lsp-enable-which-key-integration)
  (LaTeX-mode . lsp)
  (c-mode-common . lsp)
  (sh-mode . lsp)
  :commands lsp)
#+end_src

#+RESULTS:
| lsp |

* Dired icons

#+begin_src elisp
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+end_src

#+RESULTS:
| all-the-icons-dired-mode | doom-modeline-set-project-modeline | pdf-occur-dired-minor-mode | org-download-enable | dired-extra-startup | dired-hide-details-mode |

* evil mode

#+begin_src elisp
(use-package evil
:init
(evil-mode 1))
(define-key key-translation-map (kbd "ESC") (kbd "C-g"))
#+end_src

#+RESULTS:
: 

